---
kind: method
id: M:Autodesk.Revit.DB.FabricationPart.IsAStraight
source: html/6a456800-1ebc-ad50-fc4b-0b8f3fdcad7f.htm
---
# Autodesk.Revit.DB.FabricationPart.IsAStraight Method

Checks whether it is a straight part.

## Syntax (C#)
```csharp
public bool IsAStraight()
```

## Returns
True if the part is a straight part. False otherwise.